In [4]:
%matplotlib inline
import pandas as pd

In [5]:
titles = pd.read_csv('titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

## How many movies are listed in the titles dataframe?

In [6]:
titles.describe()

                year
count  244914.000000
mean     1986.616012
std        29.459912
min      1894.000000
25%      1967.000000
50%      1997.000000
75%      2012.000000
max      2115.000000

In [7]:
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244914 entries, 0 to 244913
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   title   244914 non-null  object
 1   year    244914 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.7+ MB

In [8]:
df= pd.DataFrame(titles)

In [9]:
df.title.unique()

array(['Tasveer Mere Sanam', 'Only You', 'El pueblo del terror', ...,
       'Nippon dabi katsukyu', 'Under Siege 2: Dark Territory',
       'She Must Be Seeing Things'], dtype=object)

In [10]:
df.title.nunique(dropna = True)

223828

In [11]:
# 23828 movies are listed

## What are the earliest two films listed in the titles dataframe?

In [12]:
df.sort_values(by=['year'], inplace=True)

In [13]:
df.head()

                                                    title  year
193222                                         Miss Jerry  1894
51388                                  The Startled Lover  1898
4584       Reproduction of the Corbett and Jeffries Fight  1899
219198                                     May Day Parade  1900
47548   Pierrot's Problem, or How to Make a Fat Wife O...  1900

In [14]:
# Earliest two films are "Miss Jerry" & "The Startled Lover"

## How many movies have the title "Hamlet"?

In [31]:
select_in= df.loc[df['title'] == 'Hamlet']
select_in

         title  year
52521   Hamlet  1910
198234  Hamlet  1911
39916   Hamlet  1913
10637   Hamlet  1921
101728  Hamlet  1948
172640  Hamlet  1954
161324  Hamlet  1964
67406   Hamlet  1969
122827  Hamlet  1973
133921  Hamlet  1976
82130   Hamlet  1987
192142  Hamlet  1990
178222  Hamlet  1996
62000   Hamlet  2000
189093  Hamlet  2009
173033  Hamlet  2011
202025  Hamlet  2014
154029  Hamlet  2015
88065   Hamlet  2016
6422    Hamlet  2017

In [32]:
select_in.count()

title    20
year     20
dtype: int64

In [ ]:
# 20 movies have title 'Hamlet'

## How many movies are titled "North by Northwest"?

In [33]:
select_in1= df.loc[df['title'] == 'North by Northwest']
select_in1

                    title  year
74398  North by Northwest  1959

In [34]:
select_in1.count()

title    1
year     1
dtype: int64

In [35]:
# 1 movie has title "North by Northwest"

## When was the first movie titled "Hamlet" made?

In [36]:
select_in

         title  year
52521   Hamlet  1910
198234  Hamlet  1911
39916   Hamlet  1913
10637   Hamlet  1921
101728  Hamlet  1948
172640  Hamlet  1954
161324  Hamlet  1964
67406   Hamlet  1969
122827  Hamlet  1973
133921  Hamlet  1976
82130   Hamlet  1987
192142  Hamlet  1990
178222  Hamlet  1996
62000   Hamlet  2000
189093  Hamlet  2009
173033  Hamlet  2011
202025  Hamlet  2014
154029  Hamlet  2015
88065   Hamlet  2016
6422    Hamlet  2017

In [37]:
# First movie titled "Hamlet" was made in 1910

## List all of the "Treasure Island" movies from earliest to most recent.

In [38]:
select_in2= df.loc[df['title'] == 'Treasure Island']
select_in2

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

In [39]:
# earliest "treasure Island" was made on 1918 and the latest was on 1999

## How many movies were made in the year 1950?

In [87]:
df_1950 = df[df['year']==1950]
print(df_1950.shape)

(1113, 2)

In [88]:
df_1950

                           title  year
139696         Paolo e Francesca  1950
139483           Mata au hi made  1950
16575        Por la puerta falsa  1950
17239       Marshal of Heldorado  1950
233760             La casa chica  1950
...                          ...   ...
3321    The Kid from Gower Gulch  1950
178015           Chain Lightning  1950
35352      The Woman in Question  1950
213802              Once a Thief  1950
226755    Der Geist von Allenwil  1950

[1113 rows x 2 columns]

In [93]:
#1113 movies were made in 1950

## How many movies were made in the year 1960?

In [94]:
df_1960 = df[df['year']==1960]
print(df_1960.shape)

(1549, 2)

In [95]:
df_1960

                       title  year
169713                 Lagan  1960
149574   Outside the Kulambo  1960
19493         Teen-age Crush  1960
73977              Moro mou!  1960
192109           La ciociara  1960
...                      ...   ...
70568          Kirik kalpler  1960
97486            Baeksa buin  1960
178109       Otvad horizonta  1960
225063  Fabrik der Offiziere  1960
244291         Natchez Trace  1960

[1549 rows x 2 columns]

In [96]:
#1549 movies were made in 1960

## How many movies were made from 1950 through 1959?

In [99]:
df_bw = df[(df['year']>=1950) & (df['year']<=1959)]
print(df_bw.shape)

(12934, 2)

In [100]:
df_bw

                       title  year
139696     Paolo e Francesca  1950
139483       Mata au hi made  1950
16575    Por la puerta falsa  1950
17239   Marshal of Heldorado  1950
233760         La casa chica  1950
...                      ...   ...
23340      Menschen im Hotel  1959
84474           Cara de Goma  1959
235189           Abbas yolcu  1959
63646           Laffing Time  1959
181533        The Naked Road  1959

[12934 rows x 2 columns]

In [101]:
#12934 movies were made from 1950 -1959

## In what years has a movie titled "Batman" been released?

In [102]:
select_in3= df.loc[df['title'] == 'Batman']
select_in3

         title  year
39349   Batman  1943
240896  Batman  1989

In [103]:
# Batman was released in 1943 and 1989

## How many roles were there in the movie "Inception"?

In [104]:
select_in4= df.loc[df['title'] == 'Inception']
select_in4

            title  year
183910  Inception  2010